from functions import *

alpha = float(input("Альфа: "))
print(f"Загальне середнє статистичне: {round(overall_average(), 6)}")
print(f"Q={round(Q(), 6)}; Q1={round(Q1(), 6)}; Q2={round(Q2(), 6)}; Q3={round(Q3(), 6)}")
print(f"Оцінка загальної дисперсії: {round(S_2(), 6)}")
print(f"Незміщена оцінка дисперсії за фактором 1: {round(S1_2(), 6)}")
print(f"Незміщена оцінка дисперсії за фактором 2: {round(S2_2(), 6)}")
print(f"Оцінка залишкової дисперсії: {round(S3_2(), 6)}")
print("")
print(f"Емпіричне значення Фішера-Снедекора за фактором 1: F1*={round(F_1_stat(), 6)}")
print(f"Теоретичне значення Фішера-Снедекора за фактором 1: F1={round(F_1_theoretical(alpha), 6)}")

print(f"Емпіричне значення Фішера-Снедекора за фактором 2: F2*={round(F_2_stat(), 6)}")
print(f"Теоретичне значення Фішера-Снедекора за фактором 2: F2={round(F_2_theoretical(alpha), 6)}")

if F_1_theoretical(alpha) > F_1_stat():
    print("F1* < F1, досліджуваний фактор 1 не впливає на результати вимірювань")
else:
    print("F1* > F1, досліджуваний фактор 1 впливає на результати вимірювань")

if F_2_theoretical(alpha) > F_2_stat():
    print("F2* < F2, досліджуваний фактор 2 не впливає на результати вимірювань")
else:
    print("F2* > F2, досліджуваний фактор 2 впливає на результати вимірювань")
